Repository: giellalt/corpus-fin
Catalog: tmx/smn/facta/samemusea_siida/sammallahti.html.tmx
Source language: fin
Languages: smn

source: Tutkimus
smn: Ovdâsijđo

source: I. Itkonen
smn: Tutkâmuš

source: Erkki Itkonen
smn: Elias Lönnrot

source: Matti Morottaja
smn: Heikki Mattus

source: Kirjallisuusluettelo
smn: Kirjálâsvuodâ luvâttâllâm

source: Kesäkuun 21. päivänä 1947 syntyi Helsingissä kultaseppä Lars Sammallahdelle ja konttoristi Maire Sammallahdelle (os. Halén) poikalapsi, joka kastettiin isänsä kaimaksi.
smn: Vyesimáánu 21. peeivi 1947 šoodâi Helsigist kollečeppi Lars Sammallaahtin já kontturpargee Maire Sammallaahtin (s. Halén) kandâpärni, kote kastui eejis käimin.

source: Pekka Lars Kalervo Sammallahti ehti käydä yhden vuoden kansakoulua, jonka jälkeen hän meni kymmeneksi vuodeksi Helsingin Suomalaiseen yhteiskouluun. Se oli niin tehokas koulu, että hän kirjoitti ylioppilaaksi vuonna 1965 kuudella laudaturilla, joka oli paras tulos siihen aikaan.
smn: Pekka Lars Kalervo Sammallahti kiergânij väzziđ oovtâ ive aalmugškoovlâ ađai kansaškoovlâ, jeđe moonâi love ihán Helsingin Suomalainen yhteiskoulu -nommâsâš škoovlân, mii lâi nuuvt pehtil, et sun čaalij pajeuáppen ive 1965 kuuđáin laudaturijn.

source: Pekka itse pitää SYK:ta suuressa arvossa vielä tänä päivänäkin.
smn: Tot lâi pyeremus puáđus tallaa ääigi já sun ana SYK stuorrâ áárvust vala onnáá peeivi-uv.

source: Sen jälkeen alkoi opiskelu Helsingin yliopistolla, josta hän valmistui filosofia kandidaatiksi vuonna 1971, filosofian lisensiaatiksi vuonna 1975 ja tohtorin väitöskirjan hän kirjoitti vuonna 1977, mutta tohtorin arvon hän sai vasta 2002, kun hän itse oli promoottorina Oulun tohtoripromootiossa.
smn: Tast maŋa sun luvâškuođij Helsig ollâopâttuvâst já filosofia kandidaattân sun valmâštui ive 1971, filosofia lisensiaattân ive 1975 já tuáhtár náguskirje sun čaalij ive 1977, mut tuáhtár áárvu sun finnij eskân ive 2002, ko sun lâi jieš promoottorin Oulu tuáhtárpromootiost.

source: Silloin hänet itseään pyydettiin aluksi promovoitavaksi, jonka jälkeen hän vasta pääsi vihkimään muita.
smn: Talle sun kočottâđâi vistig jieš vihkuđ tuáhtárân já eskin tast maŋa peesâi vihkâškyettiđ iärásijd.

source: Äitinsä oli tapahtuneesta hyvin iloinen, koska vanhin lapsi viimeinkin sai tohtorin arvon, oltuaan professorina neljännesvuosisadan.
smn: Ennis lâi tábáhtusâst uáli mielâst, ko puárásumos pärni viijmâg šoodâi tuáhtárin ton maŋa, ko lâi lamaš professorin niäljádâsihečyeđe.

source: Helsingin yliopiston assistenttina hän on toiminut 1968 – 1971, saman yliopiston tutkijana 1972 – 1977, Oulun yliopiston apulaisprofessorina 1977 – 1982 ja viimeisimpänä Oulun yliopiston saamenkielen ja saamelaiskulttuurin professorina vuodesta 1982 lähtien.
smn: Helsig ollâopâttuv assistenttân sun lii toimâm 1968 – 1971, siämmáá ollâopâttuv totken 1972 – 1977, Oulu ollâopâttuv išeprofessorin 1977 – 1982 já majemustáá Oulu ollâopâttuv sämikielâ já sämmilâškulttuur professorin ive 1982 rääjist.

source: Sen lisäksi hän on toiminut toisena professorina Saamen korkeakoulussa Koutokeinossa 1989 – 1996 ja Tromssan yliopistossa vuodesta 1993 lähtien tähän päivään saakka.
smn: Ton lasseen sun lii toimâm nubben professorin Säämi ollâškoovlâst Kuovdâkiäinust 1989 – 1996 já Tromsa ollâopâttuvâst 1993 rääjist onnáá räi.

source: Monien erilaisten luottamustoimien lisäksi hän on toiminut Kotimaisten kielten tutkimuskeskuksen johtokunnan jäsenenä 1985 – 1997, jonka jälkeen hän on ollut johtokunnan puheenjohtajan vuodesta 1997 lähtien.
smn: Maaŋgâi jieškote-uvlágán luáttámuštoimâi lasseen sun lii toimâm KOTUS ađai Päikkienâmij kielâi tutkâmkuávdáá stiivrâ jesânin 1985 – 1997, mon maŋa sun lii lamaš stiivrâ saavâjođetteijen ive 1997 rääjist.

source: Hänelle myönnettiin valtion kirjallisuuspalkinto jo vuonna 1975 ja valtion tiedonjulkistamispalkinto seuraavana vuonna.
smn: Sunjin mieđettui staatâ kirjálâšvuođâpalhâšume juo ive 1975 já staatâ tiäđujulgáštempalhâšume čuávvoo ive.

source: Lapissa Pekka Sammallahti kävi ensimmäisen kerran sisarensa ja isänsä kanssa vuonna 1958 ja silloin he kävivät Inarissa ja Utsjoella.
smn: Säämist Pekka Sammalahti eelij vuossmuu keerdi obijnis já ejijnis ive 1958 já talle sij ellii Anarist já Ucjuuvâst.

source: Hän oli silloin 11-vuotias ja osasi jo muutaman sanan pohjoissaamea.
smn: Sun lâi talle 11 ihásâš já maatij juo mottoom sääni orjâlâškielâ.

source: Pari vuotta myöhemmin eli kesät 1960 ja 1961 hän oli Vuotson lähellä Siikaselässä Siika-Uulan luona ja kulki myös porotöissä hänen perheensä mukana Saariselällä ja muissakin paikoissa.
smn: Muáddi ive maŋeláá ađai keesijd 1960 já 1961 sun lâi Vuáču alda Šapšâčielgist Šapšâ-Uulá kuvlân já juuđij meiddei puásuipargoin suu perruu mield Suálučielgist já eres-uv soojijn.

source: Silloin hän oppi pohjoissaamea vähän paremmin enimmäkseen Uulalta, jonka jälkeen hän onkin ollut kaikki kesät täällä Lapissa.
smn: Talle sun oopâi orjâlâškielâ váháš pyerebeht iänááš Uulást, mon maŋa sun lii-uv lamaš puoh keesijd tääbbin Säämist.

source: 1962 – 63 hän oli kesät Oula Näkkäläjärven renkinä kolmiomittaustöissä Kittilässä, Sodankylässä, Savukoskella, sekä Sallassa ja vasta silloin hän oppi kunnolla puhumaan pohjoissaamea.
smn: Äigipaje 1962 – 63 sun lâi keesijd Oula Näkkäläjärvi reŋgân kolmihâšmittedempargoin Kittâlist, Suáđigilist, Suovâkuoškâst, sehe Kyelijäävrist ađai Sallaast já talle esken sun oopâi olmânáál sárnuđ orjâlâškielâ.

source: Näkkäläjärven Oula ja Heijan-Antti olivat hänen opettajinaan.
smn: Näkkäläjäävri Vuolli já Hejá-Antti láin suu máttáátteijeeh.

source: Inarinsaamea hän oli kuullut jo vuonna 1958 Muddusjärven rannalla, mutta alkoi ymmärtää sitä jollakin tavalla vasta vuonna 1965 kun Karhu-Sammelin Matti (Matti Morottaja) autteli häntä sen polun päälle;
smn: Aanaar kielâ sun lâi kuullâm juo ive 1958 Stuorrâjäävri riddoost, mut ibbeerdškuođij tom mottoomnáálá eskin ive 1965 ko Kuobžâ-Saammâl Matti (Matti Morottaja) išádâlâi suu ton pálgá oolâ;

source: heillä oli tarkoituksenaan kirjoittaa myös inarinsaamen kurssi, mutta he saivat aikaan vain viisi oppituntia ja ne paperitkin ovat ilmeisesti kadonneet.
smn: sunnust lâi juurdâ čäälliđ aanaarkielâ kuursâ meiddei, mut suoi rahtijn tuše vittâ oppâtiijme já toh pápáreh-uv láá vissâ juo lappum.

source: Vuonna 1965 hän keräsi lähes kokonaisen kesän paikannimiä Käsivarresta ja 1966 Nunnasen ja Lisman suunnilla.
smn: Ive 1965 sun nuurâi mestâ oles keesi päikkinoomâid Kietâkierrust já 1966 Njunnáás já Lismá peln.

source: Lismassa hän oli viikon, tai kaksi.
smn: Lismáást sun orostâlâi oho ađai muáddi.

source: Silloin oli hilla-aika ja osan ajastaan hän kulkikin ihmisten mukana hillastamassa.
smn: Talle lâi luommimäigi já uási ääigist sun juuđij-uv ulmui mield luommiimin.

source: Inarinsaamen kielen kanssa hän alkoi työskennellä enemmän vuonna 1982, kun hänestä tuli Oulun yliopiston saamenkielen ja saamelaiskulttuurin professori.
smn: Aanaar kielâin sun porgâškuođij eenâb ive 1982, ko sun šoodâi Oulu ollâopâttâhân sämikielâ já sämmilâškulttuur professorin.

source: Samana vuonna hän piti yhdessä Karhu-Sammelin Matin kanssa ensimmäisen inarinsaamen kielen kurssin Ivalossa, jossa oli toistakymmentä osanottajaa.
smn: Siämmáá ive sun toolâi oovtâst Kuobžâ-Saammâl Mattijn vuossâmuu anarâškielâ kuursâ Avelist, mast lijjii nubáloh uásivälded.

source: Tuo kurssi antoi hyvän perustan tämänkin päivän kirjoittajille ja moni kirjoitti silloin ensimmäistä kertaa äidinkielellään.
smn: Tiet kurssâ adelij šiev vuáđu onnáá peeivi čälleid já maaŋgâs láá toh, kiäh čallii talle vuossâmuu keerdi jieijâs eenikielân.

source: Meidän kaikkien hyvin tuntema Sammal-Pekka puhuu hyvin mielellään inarinsaamea aina kun siihen vain on tilaisuus ja mielellään hän myös auttelee inarinsaamen edistämistyössä.
smn: Mii puohâi pyereest tubdâm Sevtil-Piäkká sárnu uáli mielâstis anarâškielâ ain ko toos lii máhđulâšvuotâ já meiddei išádâl mielâstis anarâškielâ ovdedempargoost.

source: Hänen mielestään inarinsaame on niin mutkikas, että usein täytyy miettiä, kuinka tuo taikka tämä sana oikein taipuukaan.
smn: Suu mielâst anarâškielâ lii nuuvt mokkáá, et maŋgii ferttee smietâstiđ, maht tuot ađai taat sääni sojágin.

source: Sammal-Pekka uskookin, että inarinsaamen mutkikkuus on hirveän hyvä lääke dementiaa vastaan, koska aivojen on tosissaan työskenneltävä sitä puhuttaessa.
smn: Sevtil-Piäkká osko-uv, et aanaarkielâ mokkáávuotâ lii hirmâd pyeri lekittâs dementia ađai kulhijdem vuástá, ko vuoiŋâšeh kalgeh tuođâst porgâđ tom sárnudijn.

source: Pekka Sammallahti asuu nykyään Tenon rannalla Vetsikossa ja hänen kirjallinen ansiolistansa on erittäin pitkä;
smn: Pekka Sammallahti áásá tááláá ääigist Tiänuriddoost Veččâhist já suu kirjálâš ánsulisto lii uáli kukke;

source: 104 erilaista julkaisua, joista inarinsaamen kielisiä ovat: - Säämi-suoma-säämi škovlasänikirje, jonka hän on toimittanut yhdessä Matti Morottajan kanssa vuonna 1983 - Säämi-suomâ sänikirje, jonka hän on toimittanut yhdessä Matti Morottajan kanssa vuonna 1993. Vapaa-aikanaan Pekka kulkee luonnossa metsästämässä ja kalastamassa.
smn: 104 jieškote-uvlágán olgosadalduhhâd, moin anarâškielâliih láá: - Säämi-suoma-säämi škovlasänikirje, mon sun lii toimâttâm oovtâst Matti Morottajain ive 1983 - Säämi-suomâ sänikirje, mon sun lii toimâttâm oovtâst Matti Morottajain ive 1993. Astoääigi sun jotá luándust mecci- já kyelipiivdost.

source: Professori Pekka Sammallahti metsäretkellä.
smn: Professor Pekka Sammallahti meccireeisust.
